---
kind: other
id: Properties.T:Autodesk.Revit.DB.BRepBuilderEdgeGeometry
source: html/3b1f5cb5-59c2-856f-2857-1c8174eaca37.htm
---
# BRepBuilderEdgeGeometry Properties

Specifies whether the .NET object represents a valid Revit entity.